function stringToJSON() {
	let vocabString = "وقال وزير الخارجية القطري، الشيخ محمد بن عبد الرحمن آل ثاني، خلال زيارته إلى النرويج إن السلطات السعودية لم ترد بعد على تساؤلات وزارة الشؤون الإسلامية القطرية بشأن سلامة المواطنين القطريين خلال الحج وأضاف في مؤتمر صحفي أن مستوى التوتر بين البلدين و اللغة والنبرة المستخدمة لدى وسائل الإعلام السعودية أدى لنشر الكراهية ضد القطريين، مشيراً إلى أن ذلك يمثل مصدر قلق لنا وأردف أن القطريين الذين يعبرون الحدود الآن هم مسؤولية السلطات السعودية، مضيفاً أن أكثر من مئة قطري عبر الحدود منذ إعادة فتحها الطيران السعودي لنقل القطريين وفي غضون ذلك، طلبت الخطوط الجوية العربية السعودية الحصول على إذن من قطر لنقل الحجاج القطريين الراغبين في أداء فريضة الحج  وذلك بعد أمر الملك السعودي، سلمان بن عبد العزيز، بجدولة رحلات بطائرات ضخمة لهذا الغرض على نفقته الخاصة";
	let vocabArr = vocabString.split(" ");
	let notWords = ["في", "عن", "التي", "مما", "الذي", "هو", "وهو", "وإنه", "ثم", "بي", "سي", "عليه", "لن", "لم", "أن", "أو", "الذي", "ما", "إن", ".", "إلى", "من", "به", "بها", "على", "لا", "قد", "وقد"];

	let filteredVocabArr = vocabArr.filter(function(x){
		if(!notWords.includes(x)){
			return x;
		}
	});

	let jsonReadyArr = filteredVocabArr.map(function(x){
		let obj = {};
		let arabic = "Arabic";
		let english = "English";
		obj["Arabic"] = x;
		obj["English"] = "";
		return obj;

	});

	return jsonReadyArr;
}


module.exports.init = function() {
	console.log(stringToJSON());
}

//command line -  node -e 'require("./arabic").init()'
